task/app/controllers/projects_controller.rb

  def create
    @project = current_user.projects.build(project_params)
    if @project.save
---
INSERT INTO "projects" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Hello"], ["description", "world"], ["user_id", 2], ["created_at", "2024-05-31 05:50:42.233822"], ["updated_at", "2024-05-31 05:50:42.233822"]]

  def update
    if project_params[:todo_ids].nil? || project_params[:todo_ids].empty?
      @project.todos.clear
    else
      @project.update(project_params)
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "Hello"], ["updated_at", "2024-05-28 20:10:12.797827"], ["id", 1]]