task/app/controllers/todos_controller.rb

    def create
      @todo = current_user.todos.build(todo_params)
      if @todo.save
---
INSERT INTO "todos" ("user_id", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["title", "ffv"], ["description", "jjj"], ["created_at", "2024-05-29 19:21:46.690349"], ["updated_at", "2024-05-29 19:21:46.690349"]]

    def update
      if @todo.update(todo_params)
---
UPDATE "todos" SET "description" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["description", "jjjs"], ["updated_at", "2024-05-29 19:26:10.617045"], ["id", 1]]

    def set_todo
      @todo = current_user.todos.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]