six/app/controllers/dashboard_controller.rb

SELECT DISTINCT "tasks".* FROM "tasks" INNER JOIN "projects_tasks" ON "projects_tasks"."task_id" = "tasks"."id" INNER JOIN "projects" ON "projects"."id" = "projects_tasks"."project_id" WHERE "projects"."user_id" = ?  [["user_id", 1]]
---
    def index
      @projects = current_user.projects
      @tasks = Task.joins(:projects).where(projects: { user_id: current_user.id }).distinct