app/views/projects/edit.html.erb


    <% if current_user.todos.present? %>
---
SELECT 1 AS one FROM "todos" INNER JOIN "project_tasks" ON "todos"."id" = "project_tasks"."todo_id" WHERE "project_tasks"."project_id" = ? AND "todos"."id" = ? LIMIT ?  [["project_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ?  [["user_id", 1]]

          <%= form.label :todo_ids, "Select Todos", class: "label-large" %>
          <% current_user.todos.each do |todo| %>
            <label for="todo_<%= todo.id %>" class="checkbox-container">
              <%= check_box_tag "project[todo_ids][]", todo.id, @project.todos.include?(todo), id: "todo_#{todo.id}" %>
---
SELECT "todos".* FROM "todos"
SELECT "todos"."id" FROM "todos" INNER JOIN "project_tasks" ON "todos"."id" = "project_tasks"."todo_id" WHERE "project_tasks"."project_id" = ?  [["project_id", 1]]
SELECT 1 AS one FROM "todos" INNER JOIN "project_tasks" ON "todos"."id" = "project_tasks"."todo_id" WHERE "project_tasks"."project_id" = ? AND "todos"."id" = ? LIMIT ?  [["project_id", 1], ["id", 1], ["LIMIT", 1]]