Vova/app/controllers/project_comments_controller.rb

INSERT INTO "project_comments" ("content", "user_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "12eqwdewdcew"], ["user_id", 1], ["project_id", 1], ["created_at", "2024-06-14 08:53:09.831270"], ["updated_at", "2024-06-14 08:53:09.831270"]]
---
    def create
      @project_comment = @project.project_comments.build(project_comment_params)
      @project_comment.user = current_user
      if @project_comment.save