Vova/app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "123123321"], ["description", "123312123312"], ["user_id", 1], ["created_at", "2024-06-14 08:53:02.175133"], ["updated_at", "2024-06-14 08:53:02.175133"]]
---
  def create
    @project = current_user.projects.build(project_params)
    if @project.save