Vova/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2024-06-14 12:50:48.668591"], ["password_digest", "[FILTERED]"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)