app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "some boook"], ["author", "author"], ["year", 1999], ["created_at", "2024-05-24 23:32:10.313180"], ["updated_at", "2024-05-24 23:32:10.313180"]]