app/controllers/tasks_controller.rb

    def show
      @task = @project.tasks.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 7], ["id", 1], ["LIMIT", 1]]

    def create
      @task = @project.tasks.build(task_params)
      if @task.save
---
INSERT INTO "project_tasks" ("project_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["project_id", 2], ["task_id", 1], ["created_at", "2024-06-14 12:51:14.201921"], ["updated_at", "2024-06-14 12:51:14.201921"]]
INSERT INTO "tasks" ("title", "description", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "hi task 1"], ["description", "asdsdasd"], ["project_id", 7], ["created_at", "2024-05-24 06:44:44.966042"], ["updated_at", "2024-05-24 06:44:44.966042"]]

    def edit
      @task = @project.tasks.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 7], ["id", 1], ["LIMIT", 1]]

    def update
      @task = @project.tasks.find(params[:id])
      if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 7], ["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "hi task 1333"], ["updated_at", "2024-05-24 06:46:18.477490"], ["id", 1]]