app/controllers/users_controller.rb

    def update
      if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2024-05-29 19:32:09.024730"], ["password_digest", "[FILTERED]"], ["id", 1]]