Vova/app/views/projects/show.html.erb

SELECT "project_comments".* FROM "project_comments" WHERE "project_comments"."project_id" = ?  [["project_id", 1]]
---
    <ul class="comment-list">
      <% @project.project_comments.each do |comment| %>

SELECT "tasks".* FROM "tasks" INNER JOIN "project_tasks" ON "tasks"."id" = "project_tasks"."task_id" WHERE "project_tasks"."project_id" = ?  [["project_id", 1]]
---
    <ul class="task-list">
      <% @project.tasks.each do |task| %>

SELECT "users".* FROM "users" INNER JOIN "project_users" ON "users"."id" = "project_users"."user_id" WHERE "project_users"."project_id" = ?  [["project_id", 1]]
---
    <ul>
      <% @project.users.each do |user| %>