ruby_project/app/controllers/projects_controller.rb

  def create
    @project = current_user.projects.build(project_params)
    if @project.save
---
INSERT INTO "projects" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "1231231"], ["description", "wewerwer"], ["user_id", 3], ["created_at", "2024-05-24 05:30:05.184081"], ["updated_at", "2024-05-24 05:30:05.184081"]]

  def update
    if @project.update(project_params)
---
UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "hello asd"], ["updated_at", "2024-05-27 05:20:18.757728"], ["id", 7]]