task/app/views/projects/new.html.erb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ?  [["user_id", 1]]
---

      <% if current_user.todos.present? %>

SELECT "todos".* FROM "todos"
---
          <%= form.label :todo_ids, "Select Todos", class: "label-large" %>
          <% current_user.todos.each do |todo| %>