task/app/views/projects/show.html.erb

SELECT "todos".* FROM "todos" INNER JOIN "project_tasks" ON "todos"."id" = "project_tasks"."todo_id" WHERE "project_tasks"."project_id" = ?  [["project_id", 1]]
---
  <ul>
    <% @project.todos.each do |todo| %>